# Задача 1(создать и вывести словарь)
# product ={
#    "name": "Хлеб",
#    "price": 45,
#    "in_stock": True
#}
#print(product["name"])
# print(product["price"])
# print(product["in_stock"])

# Задача 2(Изменение и добавления данных)
# product = {
#    "name": "помидор",
#    "price": 45,
#    "in_stock": True
#}
# product["price"] = 50
# product["categorie"] = "Еда"

#print(product)

# Задача 3 (перебор словаря(ключ + значения))
#product ={
#    "name": "печенье",
#    "price": 52,
 #   "in_stock": True,
#    "category":"Продукт питания"
#}
# for key, value in product.items():
#    print(key,value)

# Задача 4 (подсчет данных в словаре)
# warehouse = {
#    "яблоки": 10,
#    "персики": 8,
#    "клубника": 14
#}
# total = 0
# for amount in warehouse.values():
#    total += amount
# print("Всего товаров:", total)

# Задача 5 (поиск по словарю и по условию) #
# prices = {
#    "хлеб": 50,
#    "молоко": 90,
#    "cыр": 670,
#    "яблоки": 230,
#    "вода": 75
#}

# for name, price in prices.items():
#    if price > 80:
#        print(name, price)

