# Задача 1 #

#for i in range(1, 6):
 #   print(i)#

# Задача 2 #
#fruits = ["яблоко", "груша", "мандарин"]
#for fruits in fruits:
#    print(fruits)#


# Задача 3 #
#for num in range(1, 21):#
#    if num % 2 == 0:
#        print(f"{num} Четное!")
#    else:
#        print(f"{num}Нечетное!")


# Задача 4 #
#x = 1
#while x <= 12:
#    print(x)
#    x += 1 #



# Задача 5 цикл (while + остановка по условию)

#x = 10 
#while x >= 5:
 #   print(x)
#    x -= 1 #



# Задача 6 (Фильтрация данных) #
#numbers = [8, 14, 2, 32, 6, 14, 2, 190]
#for num in numbers:
#    if num > 10:
#       print(num)#

# Задача 7(сумма элементов списка)

#numbers = [5, 10, 15, 20]
#total = 0 

#for n in numbers:
#    total += n
#    print(total)#


# Задача 8 (найти самое большое число) #
#nums = [5, 21, 3, 4, 2332, 545]
#maximum = nums[0]
#for n in nums:
 #   if n > maximum:
 #       maximum = n 
#print(maximum)#

# Задача 9(посчитать кол-во четных чисел)# 
#numbers = [3, 6, 8, 11, 14, 16, 19]

#count = 0
#for n in numbers:
 #   if n %2 == 0:
 #       count += 1
 #   print("В списке четных чисел", count)#

# Задача 10(суммировать только положительные числа)
#numbers = [-10, 4, -23, -12, 6, -112, -113]
#total = 0 
#for n in numbers:
 #   if n > 0:
 #       total +=n 
#print("Сумма положительных цифр", total)№
