# Задача 1 #
#def hello():
#    print("Здравствуйте, я фукция!")
#hello ()

# Задача 2 #
#def greet(name):
# print(f"Приветик {name}!")
#greet("Alloha")#

# Задача 3 #

#def add(a, b):
#    return a + b
#result = add(10, 5)
#print(result)#

# Задача 4 (функиця проверка четности) #

#def is_even(num):
#    if num % 2 == 0:
#        return True
#    else:
#        return False
#print(is_even(10))
#print(is_even(17))

# Задача 5 (функция со списком) #
#def sum_list(numbers):
 #   total = 0
 #   for n in numbers:
 #       total += n 
 #   return total 
#print(sum_list([5, 10, 15, 20]))#

# Задача 6(функция + условия + список) 
#def count_event(numbers):
#    count = 0
#    for n in numbers:
#        if n % 2 == 0:
#            count += 1 
#    return count
# print(count_event([2, 5, 8, 9, 10, 12, 16, 20]))

# Задача 7 (функция поиска максимума) #
#def find_max(numbers):
#    maximum = numbers[0]
#    for n in numbers:
#        if n > maximum:
#            maximum = n
#    return maximum
# print(find_max([4, 18, 42, 11, 9, 2]))

# Задача 8 (функция с input) # 
#def check_age(age):
#    if age >= 18:
#       return "Доступ открыт"
#    else:
#        return "Доступ закрыт"
#user_age = int(input("Введите возраст: "))
#result = check_age(user_age)
#print(result)


# Задача 9 (функция с строкой)#
# def format_name(name):
#    return name.upper()
# print(format_name("anton"))

